{
  "stocks": [
    {
      "name": "Kilroy Realty Corp.",
      "ticker": "KRC",
      "price": 35.99,
      "volume": 1074231,
      "description": "Kilroy Realty is a premier owner and landlord of approximately 16 million square feet of office space across Los Angeles, San Diego, the San Francisco Bay Area, and greater Seattle. The company operates as a real estate investment trust.",
      "image": "https://api.polygon.io/v1/reference/company-branding/d3d3LmtpbHJveXJlYWx0eS5jb20/images/2023-05-01_logo.svg",
      "home_page_url": "https://www.kilroyrealty.com",
      "market_cap": 4289795427.2200003,
      "sic_description": "",
      "id": 14
    },
    {
      "name": "The Western Union Company",
      "ticker": "WU",
      "price": 11.64,
      "volume": 4961869,
      "description": "Western Union provides domestic and international money transfers through its global network of about 600,000 outside agents. The company handled over 270 million transactions in 2022 and is the largest money transfer company in the world.",
      "image": "https://api.polygon.io/v1/reference/company-branding/d3d3Lndlc3Rlcm51bmlvbi5jb20/images/2023-05-01_logo.svg",
      "home_page_url": "https://www.westernunion.com",
      "market_cap": 4344981170.400001,
      "sic_description": "SERVICES-BUSINESS SERVICES, NEC",
      "id": 15
    },
    {
      "name": "Spire Inc.",
      "ticker": "SR",
      "price": 62.57,
      "volume": 457279,
      "description": "Spire Inc is a public utility holding company with three reportable business segments: Gas Utility , Gas Marketing and Midstream. The Gas Utility segment includes the regulated operations of Laclede Gas, Alabama Gas Corporation (Alagasco), and EnergySouth Inc. The Utilities businesses operations include the purchase, retail, distribution, and sale of natural gas in Missouri, Alabama, and Mississippi. The Gas Utility segment generates a majority of the company's revenue but is subject to seasonal fluctuations. The Gas Marketing segment includes Laclede Energy Resources, Inc, whose operations include the marketing of natural gas and related activities on a non-regulated basis and the Midstream segment includes transportation and storage of natural gas.",
      "image": "https://api.polygon.io/v1/reference/company-branding/d3d3LnNwaXJlZW5lcmd5LmNvbQ/images/2023-11-22_logo.svg",
      "home_page_url": "https://www.spireenergy.com",
      "market_cap": 3381781139.7999997,
      "sic_description": "NATURAL GAS DISTRIBUTION",
      "id": 17
    },
    {
      "name": "Centene Corporation",
      "ticker": "CNC",
      "price": 74.03,
      "volume": 2348672,
      "description": "Centene is a managed-care organization focused on government-sponsored healthcare plans, including Medicaid, Medicare, and the individual exchanges. Centene served 24 million medical members as of June 2023, mostly in Medicaid (67% of membership), the individual exchanges (14%), and Medicare Advantage (6%) plans. The company also serves traditional Medicare users with its Medicare Part D pharmaceutical program.",
      "image": "https://api.polygon.io/v1/reference/company-branding/d3d3LmNlbnRlbmUuY29t/images/2023-05-01_logo.svg",
      "home_page_url": "https://www.centene.com",
      "market_cap": 39490808925,
      "sic_description": "HOSPITAL & MEDICAL SERVICE PLANS",
      "id": 18
    }
  ]
}